app/controllers/page_controller.rb

SELECT COUNT(*) FROM "tranos"
---
  def logement
    @logs = Trano.page(params[:page]).per(4)