app/controllers/tranos_controller.rb

  def index
    @tranos = Trano.all
---
SELECT "tranos".* FROM "tranos"

  def create
    @trano = Trano.new(trano_params)
    @trano.mpanera_id = params[:mpanera_id]

    respond_to do |format|
      if @trano.save
        params[:photos]['url'].each do |a|
          @photo = @trano.photos.create!(:url => a,     :trano_id => @trano.id)
---
INSERT INTO "tranos" ("mpanera_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["mpanera_id", 5], ["created_at", "2018-06-13 10:41:11.531898"], ["updated_at", "2018-06-13 10:41:11.531898"]]
INSERT INTO "photos" ("trano_id", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trano_id", 2], ["url", "thp.png"], ["created_at", "2018-06-13 10:41:11.650153"], ["updated_at", "2018-06-13 10:41:11.650153"]]

    def set_trano
      @trano = Trano.find(params[:id])
---
SELECT  "tranos".* FROM "tranos" WHERE "tranos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]